In [1]:
import pandas as pd
import xlrd

In [7]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [8]:
df_new = df[['OdName','AreaName',1980]].head()

#### Add a Column

In [10]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [12]:
df_new["New"] = [1,2,3,4,5]   #Need to provide values as a list. Total values must have to be size of ROW. Otherwise ERROR

In [13]:
df_new

           OdName AreaName  1980  New
0     Afghanistan     Asia    16    1
1         Albania   Europe     1    2
2         Algeria   Africa    80    3
3  American Samoa  Oceania     0    4
4         Andorra   Europe     0    5

### Insert column in any position

In [15]:
df_new.insert(2, "Newly_Added_Col", [10,20,30,40,50])  #Argument1 = position, Argument2 =Column_Name, Argument3 = Value List

In [16]:
df_new

           OdName AreaName  Newly_Added_Col  1980  New
0     Afghanistan     Asia               10    16    1
1         Albania   Europe               20     1    2
2         Algeria   Africa               30    80    3
3  American Samoa  Oceania               40     0    4
4         Andorra   Europe               50     0    5

#### If .loc column argument doesn't exist in Dataframe, Column with data name will be added. Rest of the values will be NaN

In [17]:
df_new.loc[1,"New_Col"] = 100  #Column "New_Col" will be created

In [18]:
df_new

           OdName AreaName  Newly_Added_Col  1980  New  New_Col
0     Afghanistan     Asia               10    16    1      NaN
1         Albania   Europe               20     1    2    100.0
2         Algeria   Africa               30    80    3      NaN
3  American Samoa  Oceania               40     0    4      NaN
4         Andorra   Europe               50     0    5      NaN